/*Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
645 -> 5
78 -> третьей цифры нет
32679 -> 6*/

Random rnd = new Random();
int[] Random = {0,End-1};
Index = 0;
In
if(){
    Console.WriteLine("третьей цифры нет");}
    else {
        Console.WriteLine(Random[2]);}

